app/views/users/_form.html.haml

    %select
      -for d in District.all
---
SELECT "districts".* FROM "districts"