district_titles = [
                             'г. Ульяновск' 		,
                             'г. Димитровград' 		,
                             'г. Новоульяновск' 	,
                             'г. Димитровград' 		,
                             'Базарносызганский район' 	,
			                 'Барышский район' 		,
                             'Вешкаймский район' 	,
                             'Инзенский район' 		,
                             'Карсунский район' 	,
                             'Кузоватовский район' 	,
                             'Майнский район' 		,
                             'Мелекесский район' 	,
                             'Николаевский район' 	,
                             'Новомалыклинский район' 	,
                             'Новоспасский район' 	,
                             'Павловский район' 	,
                             'Радищевский район' 	,
                             'Сенгилеевский район' 	,
                             'Старокулаткинский район' 	,
                             'Старомайнский район' 	,
                             'Сурский район' 		,
                             'Тереньгульский район'	,
                             'Ульяновский район' 	,
                             'Цильнинский район' 	,
                             'Чердаклинский район'
                            ]

district_titles.each do |title|
  District.find_or_create_by_title title
end

nomination_titles = [
                      'Репортаж',
                      'Новость',
                      'Статья',
                      'Интервью',
                      'Обзор'
                    ]

nomination_titles.each do |title|
  Nomination.find_or_create_by_title title
end
