app/controllers/public_works_controller.rb

SELECT "public_works".* FROM "public_works" WHERE "public_works"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @public_work = PublicWork.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "public_works" ("annotation", "created_at", "header", "header_coordinates", "nomination", "text", "title", "updated_at", "user_id", "video_link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @public_work = User.find(cookies[:current_user]).public_works.build(params[:public_work])

    if @public_work.save