app/controllers/users_controller.rb

  def new
    @user = User.new
    @district = District.all
---
SELECT "districts".* FROM "districts"

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("birth_date", "building", "city", "created_at", "district", "email", "events", "filename", "first_name", "flat", "group", "home_phone", "honors", "house", "icq", "job", "last_name", "media", "middle_name", "mobile_phone", "portfolio_content_type", "portfolio_file_name", "portfolio_file_size", "portfolio_updated_at", "role", "school", "street", "twitter", "updated_at", "vkontakte") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)